In [3]:
import numpy as np

vector = np.arange(10)

In [5]:
gt2 = vector > 2

In [6]:
gt2

array([False, False, False,  True,  True,  True,  True,  True,  True,
        True])

In [7]:
lt8 = vector < 8 # create condition

In [8]:
lt8

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
       False])

In [9]:
selected_gt2 = vector[gt2]

In [17]:
selected_gt2

array([3, 4, 5, 6, 7, 8, 9])

In [11]:
selected_lt8 = vector[lt8]

In [12]:
selected_lt8

array([0, 1, 2, 3, 4, 5, 6, 7])

In [13]:
vector[vector>5]

array([6, 7, 8, 9])

In [14]:
cond = (vector>2) & (vector<7)

In [15]:
cond

array([False, False, False,  True,  True,  True,  True, False, False,
       False])

In [16]:
vector[cond]

array([3, 4, 5, 6])

In [18]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [19]:
vector = np.arange(10)

In [20]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [21]:
vector + vector

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [22]:
vector - vector

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [23]:
vector2 = np.arange(5)

In [24]:
vector + vector2

ValueError: operands could not be broadcast together with shapes (10,) (5,)

In [27]:
a = vector / vector

C:\Users\mkhaw\AppData\Local\Temp/ipykernel_21012/324025758.py:1: RuntimeWarning: invalid value encountered in true_divide
  a = vector / vector

In [28]:
a[a np.nan]

array([], dtype=float64)

In [29]:
a == np.nan

array([False, False, False, False, False, False, False, False, False,
       False])

In [30]:
a

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [31]:
a.

AttributeError: 'numpy.ndarray' object has no attribute 'isnan'

In [35]:
cond = np.isnan(a)

In [36]:
a[cond]

array([nan])

In [37]:
vector + 10

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [38]:
vector = np.arange(10)

In [39]:
np.max(vector)

9

In [40]:
np.min(vector)

0

In [41]:
np.sqrt(vector)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [42]:
np.log(vector)

C:\Users\mkhaw\AppData\Local\Temp/ipykernel_21012/1806560963.py:1: RuntimeWarning: divide by zero encountered in log
  np.log(vector)

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

In [52]:
np.where(vector == 5)

(array([5], dtype=int64),)

In [48]:
a == np.isnan

array([False, False, False, False, False, False, False, False, False,
       False])

In [53]:
sum(vector<5)

5

In [54]:
vector<5

array([ True,  True,  True,  True,  True, False, False, False, False,
       False])

In [57]:
import math
vector = np.arange(1,11) * math.pi 
np.sin(vector)

array([ 1.22464680e-16, -2.44929360e-16,  3.67394040e-16, -4.89858720e-16,
        6.12323400e-16, -7.34788079e-16,  8.57252759e-16, -9.79717439e-16,
        1.10218212e-15, -1.22464680e-15])

In [58]:
vector = np.arange(0,math.pi+math.pi/4,math.pi/4)
np.sin(vector)

array([0.00000000e+00, 7.07106781e-01, 1.00000000e+00, 7.07106781e-01,
       1.22464680e-16])

In [59]:
math.pi+math.pi/4

3.9269908169872414

In [60]:
vector

array([0.        , 0.78539816, 1.57079633, 2.35619449, 3.14159265])

In [61]:
matrix = np.random.rand(5,5)

In [62]:
matrix

array([[0.44910358, 0.48612998, 0.2186079 , 0.47672253, 0.55591597],
       [0.10405277, 0.66791578, 0.26302728, 0.85979001, 0.70750466],
       [0.25178952, 0.58113014, 0.8608964 , 0.39793743, 0.21999917],
       [0.46384372, 0.84723324, 0.69810356, 0.12783422, 0.92303806],
       [0.97332702, 0.31775223, 0.98746779, 0.61412145, 0.49634048]])

In [ ]:
np.floor(matrix*1000)/1000

In [63]:
x = 0.44910358

In [67]:
round(x * 100)/100

0.45

In [69]:
round(x, 4)

0.4491

In [70]:
np.floor(matrix*1000)/1000

array([[0.449, 0.486, 0.218, 0.476, 0.555],
       [0.104, 0.667, 0.263, 0.859, 0.707],
       [0.251, 0.581, 0.86 , 0.397, 0.219],
       [0.463, 0.847, 0.698, 0.127, 0.923],
       [0.973, 0.317, 0.987, 0.614, 0.496]])

In [72]:
np.floor(matrix, 4)

TypeError: return arrays must be of ArrayType

In [75]:
np.floor(matrix*1000)/1000

array([[0.449, 0.486, 0.218, 0.476, 0.555],
       [0.104, 0.667, 0.263, 0.859, 0.707],
       [0.251, 0.581, 0.86 , 0.397, 0.219],
       [0.463, 0.847, 0.698, 0.127, 0.923],
       [0.973, 0.317, 0.987, 0.614, 0.496]])

In [74]:
np.round(matrix*1000)/1000

array([[0.449, 0.486, 0.219, 0.477, 0.556],
       [0.104, 0.668, 0.263, 0.86 , 0.708],
       [0.252, 0.581, 0.861, 0.398, 0.22 ],
       [0.464, 0.847, 0.698, 0.128, 0.923],
       [0.973, 0.318, 0.987, 0.614, 0.496]])

In [76]:
np.ceil(matrix*1000)/1000

array([[0.45 , 0.487, 0.219, 0.477, 0.556],
       [0.105, 0.668, 0.264, 0.86 , 0.708],
       [0.252, 0.582, 0.861, 0.398, 0.22 ],
       [0.464, 0.848, 0.699, 0.128, 0.924],
       [0.974, 0.318, 0.988, 0.615, 0.497]])

In [77]:
matrix = np.arange(1,10).reshape(3,3)

In [78]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [79]:
matrix.sum()

45

In [80]:
matrix.sum(axis=1)

array([ 6, 15, 24])

In [81]:
matrix.sum(axis=0)

array([12, 15, 18])

In [82]:
matrix.cumsum()

array([ 1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [83]:
matrix.cumprod()

array([     1,      2,      6,     24,    120,    720,   5040,  40320,
       362880], dtype=int32)

In [84]:
matrix.min(axis=1)

array([1, 4, 7])

In [85]:
matrix.min(axis=0)

array([1, 2, 3])

In [86]:
matrix = np.array([1,2,3]*3).reshape(3,3)

In [87]:
matrix

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

In [88]:
np.unique(matrix.reshape(3,3))

array([1, 2, 3])

In [89]:
import numpy as np
import pandas as pd

In [90]:
header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]

In [91]:
vector = np.array(data)

In [92]:
vector

array([4.0000e+00, 1.2345e+04, 3.8400e+01])

In [93]:
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}

In [94]:
s1 = pd.Series(data=data) # Notice the data type is float

In [95]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

0        4.0
1    12345.0
2       38.4
dtype: float64

In [97]:
s2 = pd.Series(data=data, index=header)

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [100]:
s2['chrom']

4.0

In [101]:
s1 = pd.Series(data)
s2 = pd.Series(data, header)

In [103]:
data = [1, '2s', 34] 
df = pd.Series(data)

In [104]:
df.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [469]:
# can use a dictionary to initialize a panda series
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}
pd.Series(data_dict, name='RowLabel')

chrom         4.0
pos       12345.0
filter       38.4
Name: RowLabel, dtype: float64

In [107]:
header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]
series = pd.Series(data=data, index=header)
series['chrom']

4.0

In [108]:
series['filter']

38.4

In [109]:
series = pd.Series(data)
series[0]

4.0

In [110]:
series[0]

4.0

In [111]:
series[1]

12345.0

In [112]:
series = pd.Series(data=data, index=header)

In [114]:
series['chrom']

4.0

In [115]:
## Basic operations
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

In [116]:
s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [117]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = ['3', 4899, 234, 89.9]

In [118]:
s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [121]:
header1 = ['chrom','filter', 'pos']
data1 = [4,  38.4, 12345]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

In [122]:
s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [123]:
data1 = [12345, 38.4, 4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)

In [124]:
s1 + s2

0    12348.0
1     4937.4
2      238.0
3        NaN
dtype: float64

In [126]:
dict_a = {'name': 'John', 'exam1': 89, 'exam2': 55}

In [127]:
dict_b = {'name': 'Jane', 'exam2': 78, 'exam1': 98}

In [129]:
s1 = pd.Series(dict_a)
s1

name     John
exam1      89
exam2      55
dtype: object

In [130]:
s2 = pd.Series(dict_b)
s2

name     Jane
exam2      78
exam1      98
dtype: object

In [131]:
s1 + s2

exam1         187
exam2         133
name     JohnJane
dtype: object

In [132]:
89 + 98

187

In [133]:
import numpy as np
import pandas as pd

header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

In [134]:
df = pd.DataFrame(data=data, columns=header)

In [135]:
display(df)

   exam1  exam2  exam3
0     92     70     97
1     99     80     68
2     71     81     70
3     72     68     68

In [136]:

df = pd.DataFrame(data=data, index=students, columns=header)

In [137]:
display(df)

          exam1  exam2  exam3
student1     92     70     97
student2     99     80     68
student3     71     81     70
student4     72     68     68

In [139]:
df['exam2']

student1    70
student2    80
student3    81
student4    68
Name: exam2, dtype: int32

In [140]:
df['student1']

KeyError: 'student1'

In [141]:
df.exam1

student1    92
student2    99
student3    71
student4    72
Name: exam1, dtype: int32

In [143]:
cols = ['exam1', 'exam3']
for col in cols:
    print(df[col])

student1    92
student2    99
student3    71
student4    72
Name: exam1, dtype: int32
student1    97
student2    68
student3    70
student4    68
Name: exam3, dtype: int32

In [144]:
df['average'] = (df['exam1'] + df['exam2'] + df['exam3'])/3

In [145]:
display(df)

          exam1  exam2  exam3    average
student1     92     70     97  86.333333
student2     99     80     68  82.333333
student3     71     81     70  74.000000
student4     72     68     68  69.333333

In [146]:
(92+70+97)/3

86.33333333333333

In [147]:
df.drop('average') # does not work because default for drop is to work on row labels

KeyError: "['average'] not found in axis"

In [148]:
df.drop('average', axis=1) # works on column labels

          exam1  exam2  exam3
student1     92     70     97
student2     99     80     68
student3     71     81     70
student4     72     68     68

In [149]:
df

          exam1  exam2  exam3    average
student1     92     70     97  86.333333
student2     99     80     68  82.333333
student3     71     81     70  74.000000
student4     72     68     68  69.333333

In [151]:
x = [23, 9, 4]
return_val = x.sort()

In [152]:
print(return_val)

None

In [153]:
sorted_x = x.sort()
sorted_x = sorted(x)

In [157]:
def returnSomething():
    return 1 + 1

In [158]:
val = returnSomething()
print(val)

2

In [159]:
df.drop('average', axis=1, inplace=True)

In [160]:
df

          exam1  exam2  exam3
student1     92     70     97
student2     99     80     68
student3     71     81     70
student4     72     68     68

In [161]:
df.drop('student3')

          exam1  exam2  exam3
student1     92     70     97
student2     99     80     68
student4     72     68     68

In [162]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student3']
df = pd.DataFrame(data=data, index=students, columns=header)

In [163]:
df

          exam1  exam2  exam3
student1     81     75     89
student2     88     67     97
student3     67     87     65
student3     96     67     93

In [164]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [165]:
df

          exam1  exam2  exam3
student1     66     95     68
student2     89     73     88
student3     94     85     96
student4     95     86     76

In [166]:
df.loc['student1']

exam1    66
exam2    95
exam3    68
Name: student1, dtype: int32

In [167]:
df['exam1']

student1    66
student2    89
student3    94
student4    95
Name: exam1, dtype: int32

In [168]:
df.iloc[0]

exam1    66
exam2    95
exam3    68
Name: student1, dtype: int32

In [169]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [171]:
df.loc['student1', 'exam1']

94

In [173]:
df.iloc[0, 0]

94

In [174]:
df.loc[['student1', 'student3'], ['exam1', 'exam3']]

          exam1  exam3
student1     94     71
student3     94     83

In [175]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [176]:

df>=90

          exam1  exam2  exam3
student1  False  False  False
student2  False  False  False
student3  False  False  False
student4  False  False  False

In [177]:
display(df)

          exam1  exam2  exam3
student1     87     82     76
student2     71     87     82
student3     85     77     69
student4     75     80     87

In [179]:
df[df>=80]

          exam1  exam2  exam3
student1   87.0   82.0    NaN
student2    NaN   87.0   82.0
student3   85.0    NaN    NaN
student4    NaN   80.0   87.0

In [180]:
df['exam1']>=85

student1     True
student2    False
student3     True
student4    False
Name: exam1, dtype: bool

In [181]:
df[df['exam1']>=85]

          exam1  exam2  exam3
student1     87     82     76
student3     85     77     69

In [182]:
df

          exam1  exam2  exam3
student1     87     82     76
student2     71     87     82
student3     85     77     69
student4     75     80     87

In [213]:
x = [df[df['exam1']>=85]['exam3'], df[df['exam1']<79]['exam3']]

In [214]:
x

[student1    76
 student3    69
 Name: exam3, dtype: int32,
 student2    82
 student4    87
 Name: exam3, dtype: int32]

In [195]:
x = df[df['exam1']>=85]['exam3']

In [196]:
x

student1    76
student3    69
Name: exam3, dtype: int32

In [197]:
x.values

array([76, 69])

In [199]:
x.value_counts()

76    1
69    1
Name: exam3, dtype: int64

In [215]:
s1

name     John
exam1      89
exam2      55
dtype: object

In [216]:
s2

name     Jane
exam2      78
exam1      98
dtype: object

In [217]:
x = [s1, s2]

In [218]:
x

[name     John
 exam1      89
 exam2      55
 dtype: object,
 name     Jane
 exam2      78
 exam1      98
 dtype: object]

In [219]:
df[(df['exam1']>=85) & (df['exam2']>=85)]

Empty DataFrame
Columns: [exam1, exam2, exam3]
Index: []

In [221]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student1     87     82     76
student2     71     87     82
student3     85     77     69

In [222]:
df

          exam1  exam2  exam3
student1     87     82     76
student2     71     87     82
student3     85     77     69
student4     75     80     87

In [223]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)

In [224]:
df

   exam1  exam2  exam3
0     70     90     76
1     70     70     72
2    100     90     87
3     90     74     88

In [225]:
df['name'] = students

In [226]:
df

   exam1  exam2  exam3      name
0     70     90     76  student1
1     70     70     72  student2
2    100     90     87  student3
3     90     74     88  student4

In [227]:
df['student1']

KeyError: 'student1'

In [228]:
df.set_index('name', inplace=True)

In [229]:
df

          exam1  exam2  exam3
name
student1     70     90     76
student2     70     70     72
student3    100     90     87
student4     90     74     88

In [231]:
df.loc[['student1']

exam1    70
exam2    90
exam3    76
Name: student1, dtype: int32

In [232]:
df.reset_index(inplace=True)

In [233]:
df

       name  exam1  exam2  exam3
0  student1     70     90     76
1  student2     70     70     72
2  student3    100     90     87
3  student4     90     74     88

In [234]:
df.loc['student1']

KeyError: 'student1'

In [252]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())
df.index.names = ['Students', 'Exams']

In [253]:
df

                class1  class2
Students Exams
student1 exam1      81      94
         exam2      78      79
         exam3      80      66
student2 exam1      75      99
         exam2      91      74
         exam3      98      85
student3 exam1      87      90
         exam2      94      91
         exam3      92      84

In [237]:
df.loc['student1'].loc['exam1']['class1']

84

In [239]:
df.loc['student1'].loc['exam1']

class1    84
class2    66
Name: exam1, dtype: int32

In [240]:
df.xs('student1')

       class1  class2
Exams
exam1      84      66
exam2      79      78
exam3      97      95

In [241]:
df.loc['student1']

       class1  class2
Exams
exam1      84      66
exam2      79      78
exam3      97      95

In [246]:
df.xs('student1')

       class1  class2
Exams
exam1      84      66
exam2      79      78
exam3      97      95

In [247]:
df.xs('exam1', level='Exams')

          class1  class2
Students
student1      84      66
student2      80      79
student3      69      82

In [254]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'student1 student2 student3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())
df.index.names = ['Students', 'Exams']

In [255]:
df

                   class1  class2
Students Exams
student1 student1      74      81
         student2      93      74
         student3      97      98
student2 student1      96      73
         student2      96      92
         student3      91      83
student3 student1      79      65
         student2      89      95
         student3      92      93

In [258]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [260]:
display(df)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [261]:
df.dropna()

   student1  student2  student3
0      90.0      77.0        88

In [262]:
df.dropna(axis=0)

   student1  student2  student3
0      90.0      77.0        88

In [263]:
df.dropna(axis=1)

   student3
0        88
1        65
2        93

In [264]:
df.dropna(thresh=2)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65

In [265]:
df.fillna(value=55)

   student1  student2  student3
0      90.0      77.0        88
1      84.0      55.0        65
2      55.0      55.0        93

In [266]:
df.drop(axis=0, labels=[1,2])

   student1  student2  student3
0      90.0      77.0        88

In [267]:
my_dict = {'student1': [90, 84, 'a'], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [268]:
df

  student1  student2  student3
0       90      77.0        88
1       84       NaN        65
2        a       NaN        93

In [269]:
df[df=='a']

  student1  student2  student3
0      NaN       NaN       NaN
1      NaN       NaN       NaN
2        a       NaN       NaN

In [271]:
df[df=='a'] = 20

TypeError: Cannot do inplace boolean setting on mixed-types with a non np.nan value

In [276]:
my_dict = {'student1': [90, 84, 'a'], 'student2': [77, 'b', 'c'], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [273]:
df[df=='a'] = 20

TypeError: Cannot do inplace boolean setting on mixed-types with a non np.nan value

In [277]:
df.replace('a', 20)

   student1 student2  student3
0        90       77        88
1        84        b        65
2        20        c        93

In [278]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [279]:

df.drop(axis=0, labels=[1,2])

   student1  student2  student3
0      90.0      77.0        88

In [280]:
df.drop(axis=1, columns=['student1'])

   student2  student3
0      77.0        88
1       NaN        65
2       NaN        93

In [281]:
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [283]:
df.dropna(axis=1, thresh=2)

   student1  student3
0      90.0        88
1      84.0        65
2       NaN        93

In [467]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
display(df)

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [468]:
df.drop(df.columns[(df>=10).apply(lambda col: sum(col)>0)], axis=1)

   A  B
0  0  1
1  4  5
2  8  9

In [454]:
df.columns[aa]

Index(['D'], dtype='object')

In [ ]:
df == 'C'a

In [289]:
# df[df['C'] != 6]

# drop based on condition

   A  B   C   D
0  0  1   2   3
2  8  9  10  11

In [287]:
cond

0    False
1    False
2    False
Name: C, dtype: bool

In [290]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9)
}

In [291]:
df = pd.DataFrame(my_dict)

In [292]:
df

   Exams  Students  Scores
0  exam1  student1      98
1  exam1  student2      68
2  exam1  student3      80
3  exam2  student1      89
4  exam2  student2      84
5  exam2  student3      81
6  exam3  student1      69
7  exam3  student2      69
8  exam3  student3      65

In [293]:
df.groupby('Students').mean()

             Scores
Students
student1  85.333333
student2  73.666667
student3  75.333333

In [294]:
df.groupby('Students').mean().loc['student1']

Scores    85.333333
Name: student1, dtype: float64

In [296]:
df.groupby('Exams').max()

       Students  Scores
Exams
exam1  student3      98
exam2  student3      89
exam3  student3      69

In [297]:
df.groupby('Exams').max()['Scores']

Exams
exam1    98
exam2    89
exam3    69
Name: Scores, dtype: int32

In [298]:
df.groupby('Exams').describe()

      Scores
       count       mean        std   min   25%   50%   75%   max
Exams
exam1    3.0  82.000000  15.099669  68.0  74.0  80.0  89.0  98.0
exam2    3.0  84.666667   4.041452  81.0  82.5  84.0  86.5  89.0
exam3    3.0  67.666667   2.309401  65.0  67.0  69.0  69.0  69.0

In [299]:
df.groupby('Students').describe().transpose()

Students       student1   student2   student3
Scores count   3.000000   3.000000   3.000000
       mean   85.333333  73.666667  75.333333
       std    14.843629   8.962886   8.962886
       min    69.000000  68.000000  65.000000
       25%    79.000000  68.500000  72.500000
       50%    89.000000  69.000000  80.000000
       75%    93.500000  76.500000  80.500000
       max    98.000000  84.000000  81.000000

In [307]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

marks = {
    'MarkId': [1, 2, 3, 4, 5, 6, 7, 8],
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8], 
    'Mark': [18, 20, 16, 19, 14, 20, 20, 20]
}

df3 = pd.DataFrame(marks)

In [308]:
df1

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [309]:
df2

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [310]:
df3

   MarkId  StudentId  Mark
0       1          1    18
1       2          2    20
2       3          3    16
3       4          4    19
4       5          5    14
5       6          6    20
6       7          7    20
7       8          8    20

In [311]:

pd.merge(df2, df1, how='inner', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          7       Nancy           2.0        Physics
6          8        Adam           3.0           Arts
7          9     Stevens           3.0           Arts

In [312]:

pd.merge(df1, df2, how='inner', on='DepartmentId')

   DepartmentId DepartmentName  StudentId StudentName
0             1             IT          1     Michael
1             1             IT          2        John
2             1             IT          3        Jack
3             2        Physics          4        Sara
4             2        Physics          5       Sally
5             2        Physics          7       Nancy
6             3           Arts          8        Adam
7             3           Arts          9     Stevens

In [316]:
pd.merge(df1, df2, how='outer', on='DepartmentId')

    DepartmentId DepartmentName  StudentId StudentName
0            1.0             IT        1.0     Michael
1            1.0             IT        2.0        John
2            1.0             IT        3.0        Jack
3            2.0        Physics        4.0        Sara
4            2.0        Physics        5.0       Sally
5            2.0        Physics        7.0       Nancy
6            3.0           Arts        8.0        Adam
7            3.0           Arts        9.0     Stevens
8            4.0           Math        NaN         NaN
9            NaN            NaN        6.0        Jena
10           NaN            NaN       10.0      George

In [318]:
pd.merge(df2, df1, how='left', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          6        Jena           NaN            NaN
6          7       Nancy           2.0        Physics
7          8        Adam           3.0           Arts
8          9     Stevens           3.0           Arts
9         10      George           NaN            NaN

In [319]:
pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [320]:
data = pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

In [321]:
data[['StudentName', 'Mark', 'DepartmentName']]

  StudentName  Mark DepartmentName
0     Michael    18             IT
1        John    20             IT
2        Jack    16             IT
3        Sara    19        Physics
4       Sally    14        Physics
5       Nancy    20        Physics
6        Adam    20           Arts

In [322]:
df1

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [323]:
df1['DepartmentName1'] = df1['DepartmentName']

In [324]:
df1

   DepartmentId DepartmentName DepartmentName1
0             1             IT              IT
1             2        Physics         Physics
2             3           Arts            Arts
3             4           Math            Math

In [328]:
df1.drop('DepartmentName', axis=1)

   DepartmentId DepartmentName1
0             1              IT
1             2         Physics
2             3            Arts
3             4            Math

   Exams  Students  Scores
0  exam1  student1      98
1  exam1  student2      68
2  exam1  student3      80
3  exam2  student1      89
4  exam2  student2      84
5  exam2  student3      81
6  exam3  student1      69
7  exam3  student2      69
8  exam3  student3      65

In [335]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName1': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId1': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

In [336]:
pd.merge(df2, df1, how='inner', left_on='DepartmentId1', right_on='DepartmentId')

   StudentId StudentName  DepartmentId1  DepartmentId DepartmentName1
0          1     Michael            1.0             1              IT
1          2        John            1.0             1              IT
2          3        Jack            1.0             1              IT
3          4        Sara            2.0             2         Physics
4          5       Sally            2.0             2         Physics
5          7       Nancy            2.0             2         Physics
6          8        Adam            3.0             3            Arts
7          9     Stevens            3.0             3            Arts

In [362]:
d1 = {
    'C0': ['COR0', 'COR1', 'COR2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1)

d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2)

d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3)

In [363]:
d1

{'C0': ['COR0', 'COR1', 'COR2'],
 'C1': ['C1R0', 'C1R1', 'C2R2'],
 'C2': ['C2R0', 'C2R1', 'C2R2']}

In [364]:
d2

{'C0': ['C0R3', 'C0R4', 'C0R5'],
 'C1': ['C1R3', 'C1R4', 'C1R5'],
 'C2': ['C2R3', 'C2R4', 'C2R5']}

In [365]:
d3

{'C0': ['C0R6', 'C0R7', 'C0R8'],
 'C1': ['C1R6', 'C1R7', 'C1R8'],
 'C2': ['C2R6', 'C2R7', 'C2R8']}

In [366]:

df44 = pd.concat([df1, df2, df3])

In [367]:
df44

     C0    C1    C2
0  COR0  C1R0  C2R0
1  COR1  C1R1  C2R1
2  COR2  C2R2  C2R2
0  C0R3  C1R3  C2R3
1  C0R4  C1R4  C2R4
2  C0R5  C1R5  C2R5
0  C0R6  C1R6  C2R6
1  C0R7  C1R7  C2R7
2  C0R8  C1R8  C2R8

In [375]:
df44.reset_index(inplace=True)

In [377]:
df44.drop('index', axis=1, inplace=True)

In [378]:
df44

     C0    C1    C2
0  COR0  C1R0  C2R0
1  COR1  C1R1  C2R1
2  COR2  C2R2  C2R2
3  C0R3  C1R3  C2R3
4  C0R4  C1R4  C2R4
5  C0R5  C1R5  C2R5
6  C0R6  C1R6  C2R6
7  C0R7  C1R7  C2R7
8  C0R8  C1R8  C2R8

In [342]:
d1 = {
    'C0': ['COR0', 'COR1', 'COR2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1, index=[1, 2, 3])

In [343]:
df1

     C0    C1    C2
1  COR0  C1R0  C2R0
2  COR1  C1R1  C2R1
3  COR2  C2R2  C2R2

In [344]:

d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2, index=[4, 5, 6])
df2

     C0    C1    C2
4  C0R3  C1R3  C2R3
5  C0R4  C1R4  C2R4
6  C0R5  C1R5  C2R5

In [345]:
d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3, index=[7, 8, 9])

In [346]:
df3

     C0    C1    C2
7  C0R6  C1R6  C2R6
8  C0R7  C1R7  C2R7
9  C0R8  C1R8  C2R8

In [348]:
df4 = pd.concat([df1, df2, df3])

In [351]:
df4.iloc[0]

C0    COR0
C1    C1R0
C2    C2R0
Name: 1, dtype: object

In [379]:
data

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [380]:
data['DepartmentName'].unique()

array(['IT', 'Physics', 'Arts'], dtype=object)

In [381]:
data['DepartmentName'].nunique()

3

In [382]:
data['DepartmentName'].value_counts()

IT         3
Physics    3
Arts       1
Name: DepartmentName, dtype: int64

In [383]:
data[data['Mark']>17]

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
3       4          4    19        Sara           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [384]:
def times5(val):
    return val * 5

In [385]:
data['Mark'].apply(times5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [386]:
data['Mark'].apply(lambda val: val*5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [387]:
data['Mark']= data['Mark'].apply(lambda val: val*5)

In [388]:
data

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    90     Michael           1.0             IT
1       2          2   100        John           1.0             IT
2       3          3    80        Jack           1.0             IT
3       4          4    95        Sara           2.0        Physics
4       5          5    70       Sally           2.0        Physics
5       7          7   100       Nancy           2.0        Physics
6       8          8   100        Adam           3.0           Arts

In [389]:
def upper(string):
    return string.upper()

data['DepartmentName'].apply(upper)

0         IT
1         IT
2         IT
3    PHYSICS
4    PHYSICS
5    PHYSICS
6       ARTS
Name: DepartmentName, dtype: object

In [390]:
data['DepartmentName'].apply(lambda string: string.upper())

0         IT
1         IT
2         IT
3    PHYSICS
4    PHYSICS
5    PHYSICS
6       ARTS
Name: DepartmentName, dtype: object

In [391]:
mapping = {18: 'B', 14: 'C', 19: 'A-', 20: 'A+'}

In [394]:
data['Mark']= data['Mark'].apply(lambda val: val/5)
data['Mark'].map(mapping)

0      B
1     A+
2    NaN
3     A-
4      C
5     A+
6     A+
Name: Mark, dtype: object

In [395]:
data.columns

Index(['MarkId', 'StudentId', 'Mark', 'StudentName', 'DepartmentId',
       'DepartmentName'],
      dtype='object')

In [396]:
data.drop(['StudentId', 'MarkId' , 'DepartmentId'], axis=1)

   Mark StudentName DepartmentName
0  18.0     Michael             IT
1  20.0        John             IT
2  16.0        Jack             IT
3  19.0        Sara        Physics
4  14.0       Sally        Physics
5  20.0       Nancy        Physics
6  20.0        Adam           Arts

In [397]:
data.sort_values('Mark')

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
4       5          5  14.0       Sally           2.0        Physics
2       3          3  16.0        Jack           1.0             IT
0       1          1  18.0     Michael           1.0             IT
3       4          4  19.0        Sara           2.0        Physics
1       2          2  20.0        John           1.0             IT
5       7          7  20.0       Nancy           2.0        Physics
6       8          8  20.0        Adam           3.0           Arts

In [398]:
data.sort_values('Mark', ascending=False)

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
1       2          2  20.0        John           1.0             IT
5       7          7  20.0       Nancy           2.0        Physics
6       8          8  20.0        Adam           3.0           Arts
3       4          4  19.0        Sara           2.0        Physics
0       1          1  18.0     Michael           1.0             IT
2       3          3  16.0        Jack           1.0             IT
4       5          5  14.0       Sally           2.0        Physics

In [399]:
data = pd.read_csv('students.tsv', sep='\t', names=['lastname', 'firstname', 'username', 'exam1', 'exam2', 'exam3'])

In [400]:
data

     lastname  firstname       username  exam1  exam2  exam3
0      Larson    Melissa     larsonmeli     24     89     31
1       Novak    Melissa      novakmeli     77      3     38
2      Sawyer      Wendy     sawyerwend     81     59     30
3     Schultz     Marcus    schultzmarc     59     29     67
4        Vega   Nicholas       veganich     64     12     95
..        ...        ...            ...    ...    ...    ...
95     Duncan     Andrew     duncanandr     59     87     34
96       Bush  Alexander       bushalex     82     54     25
97    Summers    Michael    summersmich     18     95     63
98     Bowers     Sandra     bowerssand     52      8     50
99  Fernandez   Jonathan  fernandezjona     74     80     22

[100 rows x 6 columns]

In [401]:
data.sort_values('exam1', ascending=False)

     lastname firstname       username  exam1  exam2  exam3
31    Terrell    Robert    terrellrobe     99     93     60
63     Taylor     Diana     taylordian     99     90      6
69      Frank   Jessica      frankjess     95     87     92
37  Rodriguez  Michelle  rodriguezmich     94     24     50
38    Kennedy      Lisa    kennedylisa     93     19     48
..        ...       ...            ...    ...    ...    ...
18     Brooks    Marcus     brooksmarc      6     81     70
50      Perez     Kelli      perezkell      6     22      3
17      Klein      John      kleinjohn      3     43     88
54      Smith   Rebecca      smithrebe      3     75     55
76     Watson   Jessica     watsonjess      2     44     50

[100 rows x 6 columns]

In [402]:
data[['exam1', 'exam2', 'exam3']].mean()

exam1    50.01
exam2    51.51
exam3    51.14
dtype: float64

In [403]:
data['average']= np.mean(data[['exam1', 'exam2', 'exam3']], axis=1)

In [404]:
data

     lastname  firstname       username  exam1  exam2  exam3    average
0      Larson    Melissa     larsonmeli     24     89     31  48.000000
1       Novak    Melissa      novakmeli     77      3     38  39.333333
2      Sawyer      Wendy     sawyerwend     81     59     30  56.666667
3     Schultz     Marcus    schultzmarc     59     29     67  51.666667
4        Vega   Nicholas       veganich     64     12     95  57.000000
..        ...        ...            ...    ...    ...    ...        ...
95     Duncan     Andrew     duncanandr     59     87     34  60.000000
96       Bush  Alexander       bushalex     82     54     25  53.666667
97    Summers    Michael    summersmich     18     95     63  58.666667
98     Bowers     Sandra     bowerssand     52      8     50  36.666667
99  Fernandez   Jonathan  fernandezjona     74     80     22  58.666667

[100 rows x 7 columns]

In [405]:
data.sort_values('average', ascending=False)

     lastname firstname       username  exam1  exam2  exam3    average
48     Ramsey      John     ramseyjohn     89     95     94  92.666667
69      Frank   Jessica      frankjess     95     87     92  91.333333
31    Terrell    Robert    terrellrobe     99     93     60  84.000000
56     Ashley      Cody     ashleycody     75     69     94  79.333333
39  Henderson  Michelle  hendersonmich     91     60     86  79.000000
..        ...       ...            ...    ...    ...    ...        ...
55       Long      Joel       longjoel     20     50      3  24.333333
30     Bailey    Amanda     baileyaman     27      4     38  23.000000
86     Cortez   Patrick     cortezpatr     18     22      2  14.000000
49     Martin      Paul     martinpaul     15     11     12  12.666667
50      Perez     Kelli      perezkell      6     22      3  10.333333

[100 rows x 7 columns]

In [406]:
data.to_csv('output.tsv', sep='\t', index=False, header=False)

In [407]:
data.head()

  lastname firstname     username  exam1  exam2  exam3    average
0   Larson   Melissa   larsonmeli     24     89     31  48.000000
1    Novak   Melissa    novakmeli     77      3     38  39.333333
2   Sawyer     Wendy   sawyerwend     81     59     30  56.666667
3  Schultz    Marcus  schultzmarc     59     29     67  51.666667
4     Vega  Nicholas     veganich     64     12     95  57.000000

In [408]:
data.head(2)

  lastname firstname    username  exam1  exam2  exam3    average
0   Larson   Melissa  larsonmeli     24     89     31  48.000000
1    Novak   Melissa   novakmeli     77      3     38  39.333333

In [409]:
data.tail()

     lastname  firstname       username  exam1  exam2  exam3    average
95     Duncan     Andrew     duncanandr     59     87     34  60.000000
96       Bush  Alexander       bushalex     82     54     25  53.666667
97    Summers    Michael    summersmich     18     95     63  58.666667
98     Bowers     Sandra     bowerssand     52      8     50  36.666667
99  Fernandez   Jonathan  fernandezjona     74     80     22  58.666667

In [410]:
data.tail(3)

     lastname firstname       username  exam1  exam2  exam3    average
97    Summers   Michael    summersmich     18     95     63  58.666667
98     Bowers    Sandra     bowerssand     52      8     50  36.666667
99  Fernandez  Jonathan  fernandezjona     74     80     22  58.666667

In [411]:

data.shape

(100, 7)

In [412]:
data.iloc[3]

lastname         Schultz
firstname         Marcus
username     schultzmarc
exam1                 59
exam2                 29
exam3                 67
average        51.666667
Name: 3, dtype: object

In [413]:
data.columns

Index(['lastname', 'firstname', 'username', 'exam1', 'exam2', 'exam3',
       'average'],
      dtype='object')

In [414]:
data.dtypes

lastname      object
firstname     object
username      object
exam1          int64
exam2          int64
exam3          int64
average      float64
dtype: object

In [415]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   lastname   100 non-null    object
 1   firstname  100 non-null    object
 2   username   100 non-null    object
 3   exam1      100 non-null    int64
 4   exam2      100 non-null    int64
 5   exam3      100 non-null    int64
 6   average    100 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 5.6+ KB

In [416]:
data.get_dtype_counts()

AttributeError: 'DataFrame' object has no attribute 'get_dtype_counts'

In [417]:
data.describe()

            exam1       exam2       exam3     average
count  100.000000  100.000000  100.000000  100.000000
mean    50.010000   51.510000   51.140000   50.886667
std     26.417585   28.497561   28.291777   16.222307
min      2.000000    1.000000    2.000000   10.333333
25%     26.750000   26.500000   27.750000   39.583333
50%     52.000000   51.500000   51.000000   50.833333
75%     73.000000   77.000000   71.500000   60.333333
max     99.000000   98.000000   98.000000   92.666667

In [420]:
data['firstname'].value_counts()

Michael        5
Christopher    3
John           3
Patrick        3
Melissa        2
              ..
Wendy          1
Kelli          1
Troy           1
Sarah          1
Jonathan       1
Name: firstname, Length: 76, dtype: int64

In [421]:
data[data['exam1'].between(75, 85)]

   lastname  firstname     username  exam1  exam2  exam3    average
1     Novak    Melissa    novakmeli     77      3     38  39.333333
2    Sawyer      Wendy   sawyerwend     81     59     30  56.666667
5     Adams     Brenda    adamsbren     80     49     60  63.000000
7     Booth    Bradley    boothbrad     85      8     77  56.666667
9     Munoz       Mary    munozmary     77     41     55  57.666667
11     Paul     Philip     paulphil     79     86     60  75.000000
14  Mcclain      Glenn  mcclainglen     85     98     52  78.333333
22   Gibson     Edward   gibsonedwa     84     27     21  44.000000
44  Santana      Linda  santanalind     77     58      4  46.333333
45   Patton     Robert   pattonrobe     78     53     20  50.333333
52     Kerr      Sarah     kerrsara     82     27     65  58.000000
56   Ashley       Cody   ashleycody     75     69     94  79.333333
61   Graham    Vanessa   grahamvane     78     76     73  75.666667
87    Chang    Kristen    changkris     78     55     94  75.666667
96     Bush  Alexander     bushalex     82     54     25  53.666667

In [422]:
data[data['exam1'].in([75, 85, 95])

SyntaxError: invalid syntax (Temp/ipykernel_21012/289328022.py, line 1)

In [423]:
data[data['exam1'].isin([75, 85, 95])]

   lastname firstname     username  exam1  exam2  exam3    average
7     Booth   Bradley    boothbrad     85      8     77  56.666667
14  Mcclain     Glenn  mcclainglen     85     98     52  78.333333
56   Ashley      Cody   ashleycody     75     69     94  79.333333
69    Frank   Jessica    frankjess     95     87     92  91.333333

In [424]:
data['exam1'].unique()

array([24, 77, 81, 59, 64, 80, 37, 85, 34, 29, 79, 16, 61, 72, 71,  3,  6,
       30, 41, 57, 84, 25, 66, 50, 47, 73, 52, 28, 27, 99, 22, 21, 94, 93,
       91, 67, 78, 53, 89, 15, 82,  9, 20, 75, 70, 10, 48, 87, 38, 95, 32,
       36, 43,  2, 18, 54, 33, 26, 23, 65, 11, 44, 74], dtype=int64)

In [425]:
data['exam1'].nunique()

63

In [426]:
np.sort(data['exam1'].unique())

array([ 2,  3,  6,  9, 10, 11, 15, 16, 18, 20, 21, 22, 23, 24, 25, 26, 27,
       28, 29, 30, 32, 33, 34, 36, 37, 38, 41, 43, 44, 47, 48, 50, 52, 53,
       54, 57, 59, 61, 64, 65, 66, 67, 70, 71, 72, 73, 74, 75, 77, 78, 79,
       80, 81, 82, 84, 85, 87, 89, 91, 93, 94, 95, 99], dtype=int64)

In [427]:
data

     lastname  firstname       username  exam1  exam2  exam3    average
0      Larson    Melissa     larsonmeli     24     89     31  48.000000
1       Novak    Melissa      novakmeli     77      3     38  39.333333
2      Sawyer      Wendy     sawyerwend     81     59     30  56.666667
3     Schultz     Marcus    schultzmarc     59     29     67  51.666667
4        Vega   Nicholas       veganich     64     12     95  57.000000
..        ...        ...            ...    ...    ...    ...        ...
95     Duncan     Andrew     duncanandr     59     87     34  60.000000
96       Bush  Alexander       bushalex     82     54     25  53.666667
97    Summers    Michael    summersmich     18     95     63  58.666667
98     Bowers     Sandra     bowerssand     52      8     50  36.666667
99  Fernandez   Jonathan  fernandezjona     74     80     22  58.666667

[100 rows x 7 columns]

In [439]:
for idx, row in data.iterrows():
    print(idx, row['firstname'])

0 Melissa
1 Melissa
2 Wendy
3 Marcus
4 Nicholas
5 Brenda
6 Charlene
7 Bradley
8 Eugene
9 Mary
10 Kimberly
11 Philip
12 Madeline
13 Cassie
14 Glenn
15 Janice
16 Catherine
17 John
18 Marcus
19 Michael
20 Elizabeth
21 Katherine
22 Edward
23 Christopher
24 Debra
25 Carlos
26 Nathan
27 Michael
28 David
29 Linda
30 Amanda
31 Robert
32 Janice
33 John
34 Kathryn
35 Paige
36 Jennifer
37 Michelle
38 Lisa
39 Michelle
40 James
41 David
42 Patrick
43 Jerome
44 Linda
45 Robert
46 Christopher
47 Andre
48 John
49 Paul
50 Kelli
51 Troy
52 Sarah
53 Stephanie
54 Rebecca
55 Joel
56 Cody
57 Rachel
58 Alex
59 Shannon
60 Michael
61 Vanessa
62 Christopher
63 Diana
64 Brandon
65 Matthew
66 Patrick
67 Judy
68 Alexandra
69 Jessica
70 Samuel
71 Alexandra
72 James
73 Carmen
74 Brian
75 Luis
76 Jessica
77 Dawn
78 Tammy
79 Angela
80 Jennifer
81 Austin
82 Carol
83 Lisa
84 Shawn
85 Michael
86 Patrick
87 Kristen
88 Brandy
89 Stephanie
90 Mariah
91 Brianna
92 Jon
93 Brian
94 Wayne
95 Andrew
96 Alexander
97 Michael
98 Sandra
99 Jonathan

In [430]:
row

0        Larson
1         Novak
2        Sawyer
3       Schultz
4          Vega
        ...
95       Duncan
96         Bush
97      Summers
98       Bowers
99    Fernandez
Name: lastname, Length: 100, dtype: object

In [434]:
row

0     48.000000
1     39.333333
2     56.666667
3     51.666667
4     57.000000
        ...
95    60.000000
96    53.666667
97    58.666667
98    36.666667
99    58.666667
Name: average, Length: 100, dtype: float64

In [435]:
idx

'average'

In [437]:
row

0     48.000000
1     39.333333
2     56.666667
3     51.666667
4     57.000000
        ...
95    60.000000
96    53.666667
97    58.666667
98    36.666667
99    58.666667
Name: average, Length: 100, dtype: float64